MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VMD15/mcu.h
#define NFC_CMD1                      (*((volatile uint32_t *)0x400ABF00))      // Flash command 1 (NFC_CMD1)
#define NFC_CMD2                      (*((volatile uint32_t *)0x400ABF04))      // Flash command 2 (NFC_CMD2)
#define NFC_CAR                       (*((volatile uint32_t *)0x400ABF08))      // Column address (NFC_CAR)
#define NFC_RAR                       (*((volatile uint32_t *)0x400ABF0C))      // Row address (NFC_RAR)
#define NFC_RPT                       (*((volatile uint32_t *)0x400ABF10))      // Flash command repeat (NFC_RPT)
#define NFC_RAI                       (*((volatile uint32_t *)0x400ABF14))      // Row address increment (NFC_RAI)
#define NFC_SR1                       (*((volatile uint32_t *)0x400ABF18))      // Flash status 1 (NFC_SR1)
#define NFC_SR2                       (*((volatile uint32_t *)0x400ABF1C))      // Flash status 2 (NFC_SR2)
#define NFC_DMA_CH1                   (*((volatile uint32_t *)0x400ABF20))      // DMA channel 1 address (NFC_DMA_CH1)
#define NFC_DMACFG                    (*((volatile uint32_t *)0x400ABF24))      // DMA configuration (NFC_DMACFG)
#define NFC_SWAP                      (*((volatile uint32_t *)0x400ABF28))      // Cach swap (NFC_SWAP)
#define NFC_SECSZ                     (*((volatile uint32_t *)0x400ABF2C))      // Sector size (NFC_SECSZ)
#define NFC_CFG                       (*((volatile uint32_t *)0x400ABF30))      // Flash configuration (NFC_CFG)
#define NFC_DMA_CH2                   (*((volatile uint32_t *)0x400ABF34))      // DMA channel 2 address (NFC_DMA_CH2)
#define NFC_ISR                       (*((volatile uint32_t *)0x400ABF38))      // Interrupt status (NFC_ISR)


//*****************************************************************************
//
// External Bus Interface (FlexBus) registers
//
//*****************************************************************************

#define FB_CSAR0                      (*((volatile uint32_t *)0x4000C000))      // Chip Select Address Register
#define FB_CSMR0                      (*((volatile uint32_t *)0x4000C004))      // Chip Select Mask Register
#define FB_CSCR0                      (*((volatile uint32_t *)0x4000C008))      // Chip Select Control Register
#define FB_CSAR1                      (*((volatile uint32_t *)0x4000C00C))      // Chip Select Address Register
#define FB_CSMR1                      (*((volatile uint32_t *)0x4000C010))      // Chip Select Mask Register
#define FB_CSCR1                      (*((volatile uint32_t *)0x4000C014))      // Chip Select Control Register
#define FB_CSAR2                      (*((volatile uint32_t *)0x4000C018))      // Chip Select Address Register
#define FB_CSMR2                      (*((volatile uint32_t *)0x4000C01C))      // Chip Select Mask Register
#define FB_CSCR2                      (*((volatile uint32_t *)0x4000C020))      // Chip Select Control Register
#define FB_CSAR3                      (*((volatile uint32_t *)0x4000C024))      // Chip Select Address Register
#define FB_CSMR3                      (*((volatile uint32_t *)0x4000C028))      // Chip Select Mask Register
#define FB_CSCR3                      (*((volatile uint32_t *)0x4000C02C))      // Chip Select Control Register
#define FB_CSAR4                      (*((volatile uint32_t *)0x4000C030))      // Chip Select Address Register
#define FB_CSMR4                      (*((volatile uint32_t *)0x4000C034))      // Chip Select Mask Register
#define FB_CSCR4                      (*((volatile uint32_t *)0x4000C038))      // Chip Select Control Register
#define FB_CSAR5                      (*((volatile uint32_t *)0x4000C03C))      // Chip Select Address Register
#define FB_CSMR5                      (*((volatile uint32_t *)0x4000C040))      // Chip Select Mask Register
#define FB_CSCR5                      (*((volatile uint32_t *)0x4000C044))      // Chip Select Control Register
#define FB_CSPMCR                     (*((volatile uint32_t *)0x4000C060))      // Chip Select port Multiplexing Control Register


//*****************************************************************************
//
// Cyclic Redundancy Check (CRC) registers
//
//*****************************************************************************

#define CRC_DATA                      (*((volatile uint32_t *)0x40032000))      // CRC Data register
#define CRC_GPOLY                     (*((volatile uint32_t *)0x40032004))      // CRC Polynomial register
#define CRC_CTRL                      (*((volatile uint32_t *)0x40032008))      // CRC Control register


//*****************************************************************************
//
// Cryptographic Acceleration Unit (CAU) registers
//
//*****************************************************************************

#define CAU_CASR                      (*((volatile uint32_t *)0xE0081000))      // Status Register
#define CAU_CAA                       (*((volatile uint32_t *)0xE0081001))      // Accumulator


//*****************************************************************************
//
// Random Number Generator Accelerator (RNGA) registers
//
//*****************************************************************************

#define RNG_CR                        (*((volatile uint32_t *)0x400A0000))      // RNGA Control Register (RNG_CR)
#define RNG_SR                        (*((volatile uint32_t *)0x400A0004))      // RNGA Status Register (RNG_SR)
#define RNG_ER                        (*((volatile uint32_t *)0x400A0008))      // RNGA Entropy Register (RNG_ER)
#define RNG_OR                        (*((volatile uint32_t *)0x400A000C))      // RNGA Output Register (RNG_OR)


//*****************************************************************************
//
// Analog-to-Digital Converter (ADC) registers
//
//*****************************************************************************

#define ADC0_SC1A                     (*((volatile uint32_t *)0x4003B000))      // ADC Status and Control Registers 1 (ADC0_SC1A)
#define ADC0_SC1B                     (*((volatile uint32_t *)0x4003B004))      // ADC Status and Control Registers 1 (ADC0_SC1B)
#define ADC0_CFG1                     (*((volatile uint32_t *)0x4003B008))      // ADC Configuration Register 1 (ADC0_CFG1)
#define ADC0_CFG2                     (*((volatile uint32_t *)0x4003B00C))      // ADC Configuration Register 2 (ADC0_CFG2)
#define ADC0_RA                       (*((volatile uint32_t *)0x4003B010))      // ADC Data Result Register (ADC0_RA)
#define ADC0_RB                       (*((volatile uint32_t *)0x4003B014))      // ADC Data Result Register (ADC0_RB)
#define ADC0_CV1                      (*((volatile uint32_t *)0x4003B018))      // Compare Value Registers (ADC0_CV1)
#define ADC0_CV2                      (*((volatile uint32_t *)0x4003B01C))      // Compare Value Registers (ADC0_CV2)
#define ADC0_SC2                      (*((volatile uint32_t *)0x4003B020))      // Status and Control Register 2 (ADC0_SC2)
#define ADC0_SC3                      (*((volatile uint32_t *)0x4003B024))      // Status and Control Register 3 (ADC0_SC3)
#define ADC0_OFS                      (*((volatile uint32_t *)0x4003B028))      // ADC Offset Correction Register (ADC0_OFS)
#define ADC0_PG                       (*((volatile uint32_t *)0x4003B02C))      // ADC Plus-Side Gain Register (ADC0_PG)
#define ADC0_MG                       (*((volatile uint32_t *)0x4003B030))      // ADC Minus-Side Gain Register (ADC0_MG)
#define ADC0_CLPD                     (*((volatile uint32_t *)0x4003B034))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPD)
#define ADC0_CLPS                     (*((volatile uint32_t *)0x4003B038))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPS)
#define ADC0_CLP4                     (*((volatile uint32_t *)0x4003B03C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP4)
#define ADC0_CLP3                     (*((volatile uint32_t *)0x4003B040))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP3)
#define ADC0_CLP2                     (*((volatile uint32_t *)0x4003B044))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP2)
#define ADC0_CLP1                     (*((volatile uint32_t *)0x4003B048))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP1)
#define ADC0_CLP0                     (*((volatile uint32_t *)0x4003B04C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP0)
#define ADC0_PGA                      (*((volatile uint32_t *)0x4003B050))      // ADC PGA Register (ADC0_PGA)
#define ADC0_CLMD                     (*((volatile uint32_t *)0x4003B054))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMD)
#define ADC0_CLMS                     (*((volatile uint32_t *)0x4003B058))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMS)
#define ADC0_CLM4                     (*((volatile uint32_t *)0x4003B05C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM4)
#define ADC0_CLM3                     (*((volatile uint32_t *)0x4003B060))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM3)
#define ADC0_CLM2                     (*((volatile uint32_t *)0x4003B064))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM2)
#define ADC0_CLM1                     (*((volatile uint32_t *)0x4003B068))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM1)
#define ADC0_CLM0                     (*((volatile uint32_t *)0x4003B06C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM0)
#define ADC1_SC1A                     (*((volatile uint32_t *)0x400BB000))      // ADC Status and Control Registers 1 (ADC1_SC1A)
#define ADC1_SC1B                     (*((volatile uint32_t *)0x400BB004))      // ADC Status and Control Registers 1 (ADC1_SC1B)
#define ADC1_CFG1                     (*((volatile uint32_t *)0x400BB008))      // ADC Configuration Register 1 (ADC1_CFG1)
#define ADC1_CFG2                     (*((volatile uint32_t *)0x400BB00C))      // ADC Configuration Register 2 (ADC1_CFG2)
#define ADC1_RA                       (*((volatile uint32_t *)0x400BB010))      // ADC Data Result Register (ADC1_RA)
#define ADC1_RB                       (*((volatile uint32_t *)0x400BB014))      // ADC Data Result Register (ADC1_RB)
#define ADC1_CV1                      (*((volatile uint32_t *)0x400BB018))      // Compare Value Registers (ADC1_CV1)
#define ADC1_CV2                      (*((volatile uint32_t *)0x400BB01C))      // Compare Value Registers (ADC1_CV2)
#define ADC1_SC2                      (*((volatile uint32_t *)0x400BB020))      // Status and Control Register 2 (ADC1_SC2)
#define ADC1_SC3                      (*((volatile uint32_t *)0x400BB024))      // Status and Control Register 3 (ADC1_SC3)
#define ADC1_OFS                      (*((volatile uint32_t *)0x400BB028))      // ADC Offset Correction Register (ADC1_OFS)
#define ADC1_PG                       (*((volatile uint32_t *)0x400BB02C))      // ADC Plus-Side Gain Register (ADC1_PG)
#define ADC1_MG                       (*((volatile uint32_t *)0x400BB030))      // ADC Minus-Side Gain Register (ADC1_MG)
#define ADC1_CLPD                     (*((volatile uint32_t *)0x400BB034))      // ADC Plus-Side General Calibration Value Register (ADC1_CLPD)
#define ADC1_CLPS                     (*((volatile uint32_t *)0x400BB038))      // ADC Plus-Side General Calibration Value Register (ADC1_CLPS)
#define ADC1_CLP4                     (*((volatile uint32_t *)0x400BB03C))      // ADC Plus-Side General Calibration Value Register (ADC1_CLP4)
#define ADC1_CLP3                     (*((volatile uint32_t *)0x400BB040))      // ADC Plus-Side General Calibration Value Register (ADC1_CLP3)
#define ADC1_CLP2                     (*((volatile uint32_t *)0x400BB044))      // ADC Plus-Side General Calibration Value Register (ADC1_CLP2)
#define ADC1_CLP1                     (*((volatile uint32_t *)0x400BB048))      // ADC Plus-Side General Calibration Value Register (ADC1_CLP1)
#define ADC1_CLP0                     (*((volatile uint32_t *)0x400BB04C))      // ADC Plus-Side General Calibration Value Register (ADC1_CLP0)
#define ADC1_PGA                      (*((volatile uint32_t *)0x400BB050))      // ADC PGA Register (ADC1_PGA)
#define ADC1_CLMD                     (*((volatile uint32_t *)0x400BB054))      // ADC Minus-Side General Calibration Value Register (ADC1_CLMD)
#define ADC1_CLMS                     (*((volatile uint32_t *)0x400BB058))      // ADC Minus-Side General Calibration Value Register (ADC1_CLMS)
#define ADC1_CLM4                     (*((volatile uint32_t *)0x400BB05C))      // ADC Minus-Side General Calibration Value Register (ADC1_CLM4)
#define ADC1_CLM3                     (*((volatile uint32_t *)0x400BB060))      // ADC Minus-Side General Calibration Value Register (ADC1_CLM3)
#define ADC1_CLM2                     (*((volatile uint32_t *)0x400BB064))      // ADC Minus-Side General Calibration Value Register (ADC1_CLM2)
#define ADC1_CLM1                     (*((volatile uint32_t *)0x400BB068))      // ADC Minus-Side General Calibration Value Register (ADC1_CLM1)
#define ADC1_CLM0                     (*((volatile uint32_t *)0x400BB06C))      // ADC Minus-Side General Calibration Value Register (ADC1_CLM0)
#define ADC2_SC1A                     (*((volatile uint32_t *)0x4003C000))      // ADC Status and Control Registers 1 (ADC2_SC1A)
#define ADC2_SC1B                     (*((volatile uint32_t *)0x4003C004))      // ADC Status and Control Registers 1 (ADC2_SC1B)
#define ADC2_CFG1                     (*((volatile uint32_t *)0x4003C008))      // ADC Configuration Register 1 (ADC2_CFG1)
#define ADC2_CFG2                     (*((volatile uint32_t *)0x4003C00C))      // ADC Configuration Register 2 (ADC2_CFG2)
#define ADC2_RA                       (*((volatile uint32_t *)0x4003C010))      // ADC Data Result Register (ADC2_RA)
#define ADC2_RB                       (*((volatile uint32_t *)0x4003C014))      // ADC Data Result Register (ADC2_RB)
#define ADC2_CV1                      (*((volatile uint32_t *)0x4003C018))      // Compare Value Registers (ADC2_CV1)
#define ADC2_CV2                      (*((volatile uint32_t *)0x4003C01C))      // Compare Value Registers (ADC2_CV2)
#define ADC2_SC2                      (*((volatile uint32_t *)0x4003C020))      // Status and Control Register 2 (ADC2_SC2)
#define ADC2_SC3                      (*((volatile uint32_t *)0x4003C024))      // Status and Control Register 3 (ADC2_SC3)
#define ADC2_OFS                      (*((volatile uint32_t *)0x4003C028))      // ADC Offset Correction Register (ADC2_OFS)
#define ADC2_PG                       (*((volatile uint32_t *)0x4003C02C))      // ADC Plus-Side Gain Register (ADC2_PG)
#define ADC2_MG                       (*((volatile uint32_t *)0x4003C030))      // ADC Minus-Side Gain Register (ADC2_MG)
#define ADC2_CLPD                     (*((volatile uint32_t *)0x4003C034))      // ADC Plus-Side General Calibration Value Register (ADC2_CLPD)
#define ADC2_CLPS                     (*((volatile uint32_t *)0x4003C038))      // ADC Plus-Side General Calibration Value Register (ADC2_CLPS)
#define ADC2_CLP4                     (*((volatile uint32_t *)0x4003C03C))      // ADC Plus-Side General Calibration Value Register (ADC2_CLP4)
#define ADC2_CLP3                     (*((volatile uint32_t *)0x4003C040))      // ADC Plus-Side General Calibration Value Register (ADC2_CLP3)
#define ADC2_CLP2                     (*((volatile uint32_t *)0x4003C044))      // ADC Plus-Side General Calibration Value Register (ADC2_CLP2)
#define ADC2_CLP1                     (*((volatile uint32_t *)0x4003C048))      // ADC Plus-Side General Calibration Value Register (ADC2_CLP1)
#define ADC2_CLP0                     (*((volatile uint32_t *)0x4003C04C))      // ADC Plus-Side General Calibration Value Register (ADC2_CLP0)
#define ADC2_PGA                      (*((volatile uint32_t *)0x4003C050))      // ADC PGA Register (ADC2_PGA)
#define ADC2_CLMD                     (*((volatile uint32_t *)0x4003C054))      // ADC Minus-Side General Calibration Value Register (ADC2_CLMD)
#define ADC2_CLMS                     (*((volatile uint32_t *)0x4003C058))      // ADC Minus-Side General Calibration Value Register (ADC2_CLMS)
#define ADC2_CLM4                     (*((volatile uint32_t *)0x4003C05C))      // ADC Minus-Side General Calibration Value Register (ADC2_CLM4)
#define ADC2_CLM3                     (*((volatile uint32_t *)0x4003C060))      // ADC Minus-Side General Calibration Value Register (ADC2_CLM3)
#define ADC2_CLM2                     (*((volatile uint32_t *)0x4003C064))      // ADC Minus-Side General Calibration Value Register (ADC2_CLM2)
#define ADC2_CLM1                     (*((volatile uint32_t *)0x4003C068))      // ADC Minus-Side General Calibration Value Register (ADC2_CLM1)
#define ADC2_CLM0                     (*((volatile uint32_t *)0x4003C06C))      // ADC Minus-Side General Calibration Value Register (ADC2_CLM0)
#define ADC3_SC1A                     (*((volatile uint32_t *)0x400BC000))      // ADC Status and Control Registers 1 (ADC3_SC1A)
#define ADC3_SC1B                     (*((volatile uint32_t *)0x400BC004))      // ADC Status and Control Registers 1 (ADC3_SC1B)
#define ADC3_CFG1                     (*((volatile uint32_t *)0x400BC008))      // ADC Configuration Register 1 (ADC3_CFG1)
#define ADC3_CFG2                     (*((volatile uint32_t *)0x400BC00C))      // ADC Configuration Register 2 (ADC3_CFG2)
#define ADC3_RA                       (*((volatile uint32_t *)0x400BC010))      // ADC Data Result Register (ADC3_RA)
#define ADC3_RB                       (*((volatile uint32_t *)0x400BC014))      // ADC Data Result Register (ADC3_RB)
#define ADC3_CV1                      (*((volatile uint32_t *)0x400BC018))      // Compare Value Registers (ADC3_CV1)
#define ADC3_CV2                      (*((volatile uint32_t *)0x400BC01C))      // Compare Value Registers (ADC3_CV2)
#define ADC3_SC2                      (*((volatile uint32_t *)0x400BC020))      // Status and Control Register 2 (ADC3_SC2)
#define ADC3_SC3                      (*((volatile uint32_t *)0x400BC024))      // Status and Control Register 3 (ADC3_SC3)
#define ADC3_OFS                      (*((volatile uint32_t *)0x400BC028))      // ADC Offset Correction Register (ADC3_OFS)
#define ADC3_PG                       (*((volatile uint32_t *)0x400BC02C))      // ADC Plus-Side Gain Register (ADC3_PG)
#define ADC3_MG                       (*((volatile uint32_t *)0x400BC030))      // ADC Minus-Side Gain Register (ADC3_MG)
#define ADC3_CLPD                     (*((volatile uint32_t *)0x400BC034))      // ADC Plus-Side General Calibration Value Register (ADC3_CLPD)
#define ADC3_CLPS                     (*((volatile uint32_t *)0x400BC038))      // ADC Plus-Side General Calibration Value Register (ADC3_CLPS)
#define ADC3_CLP4                     (*((volatile uint32_t *)0x400BC03C))      // ADC Plus-Side General Calibration Value Register (ADC3_CLP4)
#define ADC3_CLP3                     (*((volatile uint32_t *)0x400BC040))      // ADC Plus-Side General Calibration Value Register (ADC3_CLP3)
#define ADC3_CLP2                     (*((volatile uint32_t *)0x400BC044))      // ADC Plus-Side General Calibration Value Register (ADC3_CLP2)
#define ADC3_CLP1                     (*((volatile uint32_t *)0x400BC048))      // ADC Plus-Side General Calibration Value Register (ADC3_CLP1)
#define ADC3_CLP0                     (*((volatile uint32_t *)0x400BC04C))      // ADC Plus-Side General Calibration Value Register (ADC3_CLP0)
#define ADC3_PGA                      (*((volatile uint32_t *)0x400BC050))      // ADC PGA Register (ADC3_PGA)
#define ADC3_CLMD                     (*((volatile uint32_t *)0x400BC054))      // ADC Minus-Side General Calibration Value Register (ADC3_CLMD)
#define ADC3_CLMS                     (*((volatile uint32_t *)0x400BC058))      // ADC Minus-Side General Calibration Value Register (ADC3_CLMS)
#define ADC3_CLM4                     (*((volatile uint32_t *)0x400BC05C))      // ADC Minus-Side General Calibration Value Register (ADC3_CLM4)
#define ADC3_CLM3                     (*((volatile uint32_t *)0x400BC060))      // ADC Minus-Side General Calibration Value Register (ADC3_CLM3)
#define ADC3_CLM2                     (*((volatile uint32_t *)0x400BC064))      // ADC Minus-Side General Calibration Value Register (ADC3_CLM2)
#define ADC3_CLM1                     (*((volatile uint32_t *)0x400BC068))      // ADC Minus-Side General Calibration Value Register (ADC3_CLM1)
#define ADC3_CLM0                     (*((volatile uint32_t *)0x400BC06C))      // ADC Minus-Side General Calibration Value Register (ADC3_CLM0)


//*****************************************************************************
//
// Comparator (CMP) registers
//
//*****************************************************************************

#define CMP0_CR0                      (*((volatile uint32_t *)0x40073000))      // CMP Control Register 0 (CMP0_CR0)
#define CMP0_CR1                      (*((volatile uint32_t *)0x40073001))      // CMP Control Register 1 (CMP0_CR1)
#define CMP0_FPR                      (*((volatile uint32_t *)0x40073002))      // CMP Filter Period Register (CMP0_FPR)
#define CMP0_SCR                      (*((volatile uint32_t *)0x40073003))      // CMP Status and Control Register (CMP0_SCR)
#define CMP0_DACCR                    (*((volatile uint32_t *)0x40073004))      // DAC Control Register (CMP0_DACCR)
#define CMP0_MUXCR                    (*((volatile uint32_t *)0x40073005))      // MUX Control Register (CMP0_MUXCR)
#define CMP1_CR0                      (*((volatile uint32_t *)0x40073008))      // CMP Control Register 0 (CMP1_CR0)
#define CMP1_CR1                      (*((volatile uint32_t *)0x40073009))      // CMP Control Register 1 (CMP1_CR1)
#define CMP1_FPR                      (*((volatile uint32_t *)0x4007300A))      // CMP Filter Period Register (CMP1_FPR)
#define CMP1_SCR                      (*((volatile uint32_t *)0x4007300B))      // CMP Status and Control Register (CMP1_SCR)
#define CMP1_DACCR                    (*((volatile uint32_t *)0x4007300C))      // DAC Control Register (CMP1_DACCR)
#define CMP1_MUXCR                    (*((volatile uint32_t *)0x4007300D))      // MUX Control Register (CMP1_MUXCR)
#define CMP2_CR0                      (*((volatile uint32_t *)0x40073010))      // CMP Control Register 0 (CMP2_CR0)
#define CMP2_CR1                      (*((volatile uint32_t *)0x40073011))      // CMP Control Register 1 (CMP2_CR1)
#define CMP2_FPR                      (*((volatile uint32_t *)0x40073012))      // CMP Filter Period Register (CMP2_FPR)
#define CMP2_SCR                      (*((volatile uint32_t *)0x40073013))      // CMP Status and Control Register (CMP2_SCR)
#define CMP2_DACCR                    (*((volatile uint32_t *)0x40073014))      // DAC Control Register (CMP2_DACCR)
#define CMP2_MUXCR                    (*((volatile uint32_t *)0x40073015))      // MUX Control Register (CMP2_MUXCR)
#define CMP3_CR0                      (*((volatile uint32_t *)0x40073018))      // CMP Control Register 0 (CMP3_CR0)
#define CMP3_CR1                      (*((volatile uint32_t *)0x40073019))      // CMP Control Register 1 (CMP3_CR1)
#define CMP3_FPR                      (*((volatile uint32_t *)0x4007301A))      // CMP Filter Period Register (CMP3_FPR)
#define CMP3_SCR                      (*((volatile uint32_t *)0x4007301B))      // CMP Status and Control Register (CMP3_SCR)
#define CMP3_DACCR                    (*((volatile uint32_t *)0x4007301C))      // DAC Control Register (CMP3_DACCR)
#define CMP3_MUXCR                    (*((volatile uint32_t *)0x4007301D))      // MUX Control Register (CMP3_MUXCR)


