MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VMD15/mcu.h
#define LOCRE1                        0x00000080      // Loss of Clock Reset Enable
#define CME1                          0x00000020      // Clock Monitor Enable1
#define LOCS1                         0x00000001      // RTC Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C10 register.
//
//*****************************************************************************

#define LOCRE2                        0x00000080      // OSC1 Loss of Clock Reset Enable
#define RANGE1                        0x00000060      // Frequency Range1 Select
#define HGO1                          0x00000008      // High Gain Oscillator1 Select
#define EREFS1                        0x00000004      // External Reference Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C11 register.
//
//*****************************************************************************

#define PLLREFSEL1                    0x00000080      // PLL1 External Reference Select
#define PLLCLKEN1                     0x00000040      // PLL1 Clock Enable
#define PLLSTEN1                      0x00000020      // PLL1 Stop Enable
#define PLLCS                         0x00000010      // PLL Clock Select
#define PRDIV1                        0x0000001C      // PLL1 External Reference Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C12 register.
//
//*****************************************************************************

#define LOLIE1                        0x00000080      // PLL1 Loss of Lock Interrupt Enable
#define CME2                          0x00000020      // Clock Monitor Enable2
#define VDIV1                         0x000001F0      // VCO1 Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_S2 register.
//
//*****************************************************************************

#define LOLS1                         0x00000080      // Loss of Lock Status
#define LOCK1                         0x00000040      // Lock Status
#define PLLCST                        0x00000020      // PLL Clock Select Status
#define OSCINIT1                      0x00000002      // OSC Initialization
#define LOCS2                         0x00000001      // OSC1 Loss of Clock Status
#define PLLCST                        0x00000010      // PLL Clock Select Status


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC0_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define EREFSTEN                      0x00000020      // Enable External Reference Clock Status
#define SC2P                          0x00000010      // Select Clock 2 Prescaler
#define SC4P                          0x00000008      // Select Clock 4 Prescaler
#define SC8P                          0x00000004      // Select Clock 8 Prescaler
#define SC16P                         0x00000002      // Select Clock 16 Prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC1_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define EREFSTEN                      0x00000020      // Enable External Reference Clock Status
#define SC2P                          0x00000010      // Select Clock 2 Prescaler
#define SC4P                          0x00000008      // Select Clock 4 Prescaler
#define SC8P                          0x00000004      // Select Clock 8 Prescaler
#define SC16P                         0x00000002      // Select Clock 16 Prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCCR register.
//
//*****************************************************************************

#define GO                            0x80000000      // Initiate Cache Command
#define PUSHW1                        0x08000000      // Push Way 1
#define INVW1                         0x04000000      // Invalidate Way 1
#define PUSHW0                        0x02000000      // Push Way 0
#define INVW0                         0x01000000      // Invalidate Way 0
#define ENWRBUF                       0x00000002      // Enable Write Buffer
#define ENCACHE                       0x00000001      // Cache enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCLCR register.
//
//*****************************************************************************

#define LACC                          0x08000000      // Line access type
#define LADSEL                        0x04000000      // Line Address Select
#define LCMD                          0x06000000      // Line Command
#define LCWAY                         0x00400000      // Line Command Way
#define LCIMB                         0x00200000      // Line Command Initial Modified Bit
#define LCIVB                         0x00100000      // Line Command Initial Valid Bit
#define TDSEL                         0x00010000      // Tag/Data Select
#define WSEL                          0x00004000      // Way select
#define LGO                           0x00000001      // Initiate Cache Line Command


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCSAR register.
//
//*****************************************************************************

#define LGO                           0x00000001      // Initiate Cache Line Command


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCCVR register.
//
//*****************************************************************************

#define DATA                          0x7FFFFFFF80000000      // Cache read/write Data


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCRMR register.
//
//*****************************************************************************

#define R0                            0x180000000      // Region 0 mode
#define R1                            0x60000000      // Region 1 mode
#define R2                            0x18000000      // Region 2 mode
#define R3                            0x06000000      // Region 3 mode
#define R4                            0x01800000      // Region 4 mode
#define R5                            0x00600000      // Region 5 mode
#define R6                            0x00180000      // Region 6 mode
#define R7                            0x00060000      // Region 7 mode
#define R8                            0x00018000      // Region 8 mode
#define R9                            0x00006000      // Region 9 mode
#define R10                           0x00001800      // Region 10 mode
#define R11                           0x00000600      // Region 11 mode
#define R12                           0x00000180      // Region 12 mode
#define R13                           0x00000060      // Region 13 mode
#define R14                           0x00000018      // Region 14 mode
#define R15                           0x00000006      // Region 15 mode


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PSCCR register.
//
//*****************************************************************************

